Stats/Consolidation/Native/mmap_3.log
file1: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=4
file2: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=32
file3: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=8
file4: (g=0): rw=randrw, bs=256K-256K/256K-256K/256K-256K, ioengine=mmap, iodepth=16
fio-2.2.8
Starting 4 processes

file1: (groupid=0, jobs=1): err= 0: pid=5074: Sun Feb 21 20:04:53 2016
  read : io=270848KB, bw=988.13KB/s, iops=3, runt=274134msec
    clat (msec): min=4, max=358, avg=130.65, stdev=58.62
     lat (msec): min=4, max=358, avg=130.65, stdev=58.62
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[   37], 10.00th=[   51], 20.00th=[   76],
     | 30.00th=[  101], 40.00th=[  118], 50.00th=[  131], 60.00th=[  145],
     | 70.00th=[  161], 80.00th=[  178], 90.00th=[  204], 95.00th=[  227],
     | 99.00th=[  277], 99.50th=[  302], 99.90th=[  347], 99.95th=[  359],
     | 99.99th=[  359]
    bw (KB  /s): min=  321, max= 9606, per=26.09%, avg=1030.93, stdev=638.53
  write: io=253440KB, bw=946699B/s, iops=3, runt=274134msec
    clat (msec): min=9, max=356, avg=137.18, stdev=58.35
     lat (msec): min=9, max=356, avg=137.18, stdev=58.35
    clat percentiles (msec):
     |  1.00th=[   22],  5.00th=[   45], 10.00th=[   61], 20.00th=[   83],
     | 30.00th=[  108], 40.00th=[  124], 50.00th=[  139], 60.00th=[  151],
     | 70.00th=[  167], 80.00th=[  184], 90.00th=[  210], 95.00th=[  235],
     | 99.00th=[  289], 99.50th=[  314], 99.90th=[  355], 99.95th=[  355],
     | 99.99th=[  355]
    bw (KB  /s): min=  360, max= 5283, per=26.63%, avg=984.72, stdev=475.73
    lat (msec) : 10=0.83%, 20=0.78%, 50=6.40%, 100=20.26%, 250=69.04%
    lat (msec) : 500=2.69%
  cpu          : usr=0.09%, sys=0.72%, ctx=136609, majf=131072, minf=83
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=4
file2: (groupid=0, jobs=1): err= 0: pid=5075: Sun Feb 21 20:04:53 2016
  read : io=270848KB, bw=990.41KB/s, iops=3, runt=273475msec
    clat (msec): min=15, max=313, avg=130.51, stdev=56.95
     lat (msec): min=15, max=313, avg=130.51, stdev=56.95
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   42], 10.00th=[   53], 20.00th=[   80],
     | 30.00th=[   99], 40.00th=[  115], 50.00th=[  128], 60.00th=[  143],
     | 70.00th=[  161], 80.00th=[  180], 90.00th=[  204], 95.00th=[  229],
     | 99.00th=[  273], 99.50th=[  293], 99.90th=[  310], 99.95th=[  314],
     | 99.99th=[  314]
    bw (KB  /s): min=  333, max= 4430, per=26.27%, avg=1038.07, stdev=507.50
  write: io=253440KB, bw=948980B/s, iops=3, runt=273475msec
    clat (msec): min=12, max=392, avg=136.67, stdev=56.00
     lat (msec): min=12, max=392, avg=136.67, stdev=56.00
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   46], 10.00th=[   59], 20.00th=[   88],
     | 30.00th=[  108], 40.00th=[  124], 50.00th=[  139], 60.00th=[  151],
     | 70.00th=[  167], 80.00th=[  182], 90.00th=[  206], 95.00th=[  227],
     | 99.00th=[  281], 99.50th=[  297], 99.90th=[  392], 99.95th=[  392],
     | 99.99th=[  392]
    bw (KB  /s): min=  336, max= 3000, per=26.93%, avg=996.02, stdev=446.63
    lat (msec) : 20=0.63%, 50=6.98%, 100=20.80%, 250=69.09%, 500=2.49%
  cpu          : usr=0.08%, sys=0.73%, ctx=136549, majf=131072, minf=256
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
file3: (groupid=0, jobs=1): err= 0: pid=5076: Sun Feb 21 20:04:53 2016
  read : io=270848KB, bw=993.31KB/s, iops=3, runt=272674msec
    clat (msec): min=19, max=350, avg=133.88, stdev=55.22
     lat (msec): min=19, max=350, avg=133.88, stdev=55.22
    clat percentiles (msec):
     |  1.00th=[   26],  5.00th=[   43], 10.00th=[   59], 20.00th=[   84],
     | 30.00th=[  104], 40.00th=[  123], 50.00th=[  137], 60.00th=[  151],
     | 70.00th=[  163], 80.00th=[  180], 90.00th=[  204], 95.00th=[  227],
     | 99.00th=[  265], 99.50th=[  289], 99.90th=[  322], 99.95th=[  351],
     | 99.99th=[  351]
    bw (KB  /s): min=  352, max= 3961, per=26.11%, avg=1031.68, stdev=504.78
  write: io=253440KB, bw=951768B/s, iops=3, runt=272674msec
    clat (msec): min=16, max=354, avg=132.26, stdev=54.23
     lat (msec): min=16, max=354, avg=132.27, stdev=54.23
    clat percentiles (msec):
     |  1.00th=[   26],  5.00th=[   43], 10.00th=[   59], 20.00th=[   83],
     | 30.00th=[  104], 40.00th=[  121], 50.00th=[  135], 60.00th=[  145],
     | 70.00th=[  159], 80.00th=[  176], 90.00th=[  202], 95.00th=[  225],
     | 99.00th=[  265], 99.50th=[  281], 99.90th=[  355], 99.95th=[  355],
     | 99.99th=[  355]
    bw (KB  /s): min=  340, max= 2865, per=26.97%, avg=997.31, stdev=435.80
    lat (msec) : 20=0.20%, 50=6.59%, 100=21.24%, 250=70.21%, 500=1.76%
  cpu          : usr=0.07%, sys=0.74%, ctx=136746, majf=131072, minf=315
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=8
file4: (groupid=0, jobs=1): err= 0: pid=5077: Sun Feb 21 20:04:53 2016
  read : io=270848KB, bw=1003.6KB/s, iops=3, runt=269885msec
    clat (msec): min=15, max=319, avg=130.51, stdev=55.88
     lat (msec): min=15, max=319, avg=130.51, stdev=55.88
    clat percentiles (msec):
     |  1.00th=[   28],  5.00th=[   44], 10.00th=[   58], 20.00th=[   76],
     | 30.00th=[   99], 40.00th=[  117], 50.00th=[  131], 60.00th=[  145],
     | 70.00th=[  159], 80.00th=[  178], 90.00th=[  206], 95.00th=[  227],
     | 99.00th=[  273], 99.50th=[  281], 99.90th=[  310], 99.95th=[  318],
     | 99.99th=[  318]
    bw (KB  /s): min=  382, max= 2953, per=26.63%, avg=1052.51, stdev=471.69
  write: io=253440KB, bw=961604B/s, iops=3, runt=269885msec
    clat (msec): min=17, max=375, avg=133.04, stdev=53.47
     lat (msec): min=17, max=375, avg=133.04, stdev=53.47
    clat percentiles (msec):
     |  1.00th=[   32],  5.00th=[   51], 10.00th=[   63], 20.00th=[   83],
     | 30.00th=[  102], 40.00th=[  119], 50.00th=[  133], 60.00th=[  145],
     | 70.00th=[  161], 80.00th=[  178], 90.00th=[  202], 95.00th=[  225],
     | 99.00th=[  262], 99.50th=[  281], 99.90th=[  375], 99.95th=[  375],
     | 99.99th=[  375]
    bw (KB  /s): min=  337, max= 2261, per=27.34%, avg=1010.85, stdev=431.12
    lat (msec) : 20=0.10%, 50=5.86%, 100=23.29%, 250=68.46%, 500=2.29%
  cpu          : usr=0.07%, sys=0.75%, ctx=136673, majf=131072, minf=490
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1058/w=990/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: io=1058.0MB, aggrb=3952KB/s, minb=988KB/s, maxb=1003KB/s, mint=269885msec, maxt=274134msec
  WRITE: io=990.0MB, aggrb=3698KB/s, minb=924KB/s, maxb=939KB/s, mint=269885msec, maxt=274134msec

Disk stats (read/write):
    dm-2: ios=523521/12211, merge=0/0, ticks=899856/183610, in_queue=1083471, util=99.98%, aggrios=524288/12263, aggrmerge=0/17, aggrticks=900416/184019, aggrin_queue=1084326, aggrutil=99.98%
  sda: ios=524288/12263, merge=0/17, ticks=900416/184019, in_queue=1084326, util=99.98%