Stats/Consolidation/Native/net2_19.log
pingpong_reader: (g=0): rw=read, bs=64-64/64-64/64-64, ioengine=net, iodepth=1
normal_reader: (g=0): rw=read, bs=64-64/64-64/64-64, ioengine=net, iodepth=1
pingpong_writer: (g=0): rw=write, bs=64-64/64-64/64-64, ioengine=net, iodepth=1
fio-2.2.8
Starting 3 processes

pingpong_reader: (groupid=0, jobs=1): err= 0: pid=3311: Mon Feb 22 00:18:32 2016
  read : io=102400KB, bw=21380Kbit/s, iops=42759, runt= 38317msec
    clat (usec): min=7, max=108, avg=22.14, stdev= 2.03
     lat (usec): min=7, max=109, avg=22.26, stdev= 2.03
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   20], 10.00th=[   20], 20.00th=[   21],
     | 30.00th=[   21], 40.00th=[   21], 50.00th=[   22], 60.00th=[   22],
     | 70.00th=[   22], 80.00th=[   23], 90.00th=[   24], 95.00th=[   26],
     | 99.00th=[   30], 99.50th=[   31], 99.90th=[   37], 99.95th=[   43],
     | 99.99th=[   48]
    bw (Kbit/s): min=    0, max=22888, per=100.00%, avg=21091.12, stdev=2667.84
    lat (usec) : 10=0.03%, 20=0.20%, 50=99.77%, 100=0.01%, 250=0.01%
  cpu          : usr=10.95%, sys=47.04%, ctx=1637663, majf=0, minf=53
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1638400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
normal_reader: (groupid=0, jobs=1): err= 0: pid=3312: Mon Feb 22 00:18:32 2016
  read : io=102400KB, bw=21380Kbit/s, iops=42759, runt= 38317msec
    clat (usec): min=1, max=107, avg=22.38, stdev= 2.06
     lat (usec): min=1, max=107, avg=22.48, stdev= 2.06
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   20], 10.00th=[   21], 20.00th=[   21],
     | 30.00th=[   21], 40.00th=[   22], 50.00th=[   22], 60.00th=[   23],
     | 70.00th=[   23], 80.00th=[   23], 90.00th=[   24], 95.00th=[   26],
     | 99.00th=[   31], 99.50th=[   33], 99.90th=[   36], 99.95th=[   38],
     | 99.99th=[   43]
    bw (Kbit/s): min=    0, max=22888, per=100.00%, avg=21091.01, stdev=2667.78
    lat (usec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.89%, 50=99.11%
    lat (usec) : 100=0.01%, 250=0.01%
  cpu          : usr=11.31%, sys=15.26%, ctx=1638433, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1638400/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
pingpong_writer: (groupid=0, jobs=1): err= 0: pid=3313: Mon Feb 22 00:18:32 2016
  write: io=102400KB, bw=21380Kbit/s, iops=42759, runt= 38317msec
    clat (usec): min=16, max=84, avg=21.92, stdev= 1.80
     lat (usec): min=16, max=84, avg=22.07, stdev= 1.81
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   20], 10.00th=[   20], 20.00th=[   21],
     | 30.00th=[   21], 40.00th=[   21], 50.00th=[   22], 60.00th=[   22],
     | 70.00th=[   22], 80.00th=[   23], 90.00th=[   24], 95.00th=[   26],
     | 99.00th=[   29], 99.50th=[   30], 99.90th=[   34], 99.95th=[   35],
     | 99.99th=[   39]
    bw (Kbit/s): min=18144, max=22888, per=100.00%, avg=21368.74, stdev=1096.39
    lat (usec) : 20=0.14%, 50=99.86%, 100=0.01%
  cpu          : usr=13.97%, sys=68.50%, ctx=1619707, majf=0, minf=54
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1638400/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=204800KB, aggrb=42752Kbit/s, minb=21376Kbit/s, maxb=21376Kbit/s, mint=38317msec, maxt=38317msec
  WRITE: io=102400KB, aggrb=21376Kbit/s, minb=21376Kbit/s, maxb=21376Kbit/s, mint=38317msec, maxt=38317msec